app/Models/Organization.php

    public function getUserCountAttribute()
    {
        return $this->users()->count();
---
SELECT count(*) as aggregate FROM `users` WHERE `users`.`organization_id` = 1 and `users`.`organization_id` IS not NULL

    public function getClinicCountAttribute()
    {
        return $this->clinics()->count();
---
SELECT count(*) as aggregate FROM `clinics` WHERE `clinics`.`organization_id` = 1 and `clinics`.`organization_id` IS not NULL